# Ne change rien à ton code, copie juste ça dans confige/Menu.py :

MENU_PRINCIPALE_ADMINE = """
###############################################################
#                                                             #
#    Bienvenue dans le système de gestion de utilisateurs     #
#                     principale (ADMIS) !                    #
#                                                             #
###############################################################
...............................................................

                 > [1] Gérer les utilisateurs
                 > [2] Gérer les Professeurs
                 > [3] Gérer les étudiants
                 > [4] DECONNEXION

...............................................................
"""

MENU_PROFESSEUR = """
###############################################################
#                                                             #
#    Bienvenue dans le système de gestion des utilisateurs    #
#                        professeur !                         #
#                                                             #
#  ─────────────────────────────────────────────────────────  #
#                                                             #
#         [1] Saisir les notes des étudiants                  #
#         [2] Gérer les  absences des étudiants               #
#         [3] DECONNEXION                                     #
#                                                             #
###############################################################
 """

MENU_ETUDIANT = """
###############################################################
#                                                             #
#    Bienvenue dans le système de gestion des utilisateurs    #
#                         étudiant !                          #
#                                                             #
#  ─────────────────────────────────────────────────────────  #
#                                                             #
#         [1] Consult the notes                               #
#         [2] consult absences                                #
#         [3] DECONNEXION                                     #
#                                                             #
###############################################################
"""

MENU_PRINCIPALE = """
┌─────────────────────────────────────────────────────────────┐
│ █▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█ │
│ █         E D U - M A N A G E R   v 2 . 0                █ │
│ █              - Portail de Connexion -                  █ │
│ █▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█ │
└─────────────────────────────────────────────────────────────┘

                  ┌─────────────────────────┐
                  │  [1] 🔑 Se connecter    │
                  │  [2] ❌ Quitter         │
                  └─────────────────────────┘

 ─────────────────────────────────────────────────────────────
  """

MENU_CONNECTION = """
###############################################################
#                                                             #
#          SGU : SYSTÈME DE GESTION DES UTILISATEURS          #
#                     - ACCÈS SÉCURISÉ -                      #
#                                                             #
###############################################################
"""
